ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/port.h
/*
 * Component description for PORT
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_PORT_COMPONENT_H_
#define _SAMD21_PORT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PORT                                         */
/* ************************************************************************** */

/* -------- PORT_DIR : (PORT Offset: 0x00) (R/W 32) Data Direction -------- */
#define PORT_DIR_RESETVALUE _UINT32_(0x00) /*  (PORT_DIR) Data Direction  Reset Value */

#define PORT_DIR_DIR_Pos _UINT32_(0) /* (PORT_DIR) Port Data Direction Position */
#define PORT_DIR_DIR_Msk (_UINT32_(0xFFFFFFFF) << PORT_DIR_DIR_Pos) /* (PORT_DIR) Port Data Direction Mask */
#define PORT_DIR_DIR(value)                                                                                            \
        (PORT_DIR_DIR_Msk &                                                                                            \
         (_UINT32_(value) << PORT_DIR_DIR_Pos)) /* Assigment of value for DIR in the PORT_DIR register */
#define PORT_DIR_Msk _UINT32_(0xFFFFFFFF) /* (PORT_DIR) Register Mask  */


/* -------- PORT_DIRCLR : (PORT Offset: 0x04) (R/W 32) Data Direction Clear -------- */
#define PORT_DIRCLR_RESETVALUE _UINT32_(0x00) /*  (PORT_DIRCLR) Data Direction Clear  Reset Value */

#define PORT_DIRCLR_DIRCLR_Pos _UINT32_(0) /* (PORT_DIRCLR) Port Data Direction Clear Position */
#define PORT_DIRCLR_DIRCLR_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_DIRCLR_DIRCLR_Pos) /* (PORT_DIRCLR) Port Data Direction Clear Mask */
#define PORT_DIRCLR_DIRCLR(value)                                                                                      \
        (PORT_DIRCLR_DIRCLR_Msk &                                                                                      \
         (_UINT32_(value) << PORT_DIRCLR_DIRCLR_Pos)) /* Assigment of value for DIRCLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_Msk _UINT32_(0xFFFFFFFF) /* (PORT_DIRCLR) Register Mask  */


/* -------- PORT_DIRSET : (PORT Offset: 0x08) (R/W 32) Data Direction Set -------- */
#define PORT_DIRSET_RESETVALUE _UINT32_(0x00) /*  (PORT_DIRSET) Data Direction Set  Reset Value */

#define PORT_DIRSET_DIRSET_Pos _UINT32_(0) /* (PORT_DIRSET) Port Data Direction Set Position */
#define PORT_DIRSET_DIRSET_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_DIRSET_DIRSET_Pos) /* (PORT_DIRSET) Port Data Direction Set Mask */
#define PORT_DIRSET_DIRSET(value)                                                                                      \
        (PORT_DIRSET_DIRSET_Msk &                                                                                      \
         (_UINT32_(value) << PORT_DIRSET_DIRSET_Pos)) /* Assigment of value for DIRSET in the PORT_DIRSET register */
#define PORT_DIRSET_Msk _UINT32_(0xFFFFFFFF) /* (PORT_DIRSET) Register Mask  */


/* -------- PORT_DIRTGL : (PORT Offset: 0x0C) (R/W 32) Data Direction Toggle -------- */
#define PORT_DIRTGL_RESETVALUE _UINT32_(0x00) /*  (PORT_DIRTGL) Data Direction Toggle  Reset Value */

#define PORT_DIRTGL_DIRTGL_Pos _UINT32_(0) /* (PORT_DIRTGL) Port Data Direction Toggle Position */
#define PORT_DIRTGL_DIRTGL_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_DIRTGL_DIRTGL_Pos) /* (PORT_DIRTGL) Port Data Direction Toggle Mask */
#define PORT_DIRTGL_DIRTGL(value)                                                                                      \
        (PORT_DIRTGL_DIRTGL_Msk &                                                                                      \
         (_UINT32_(value) << PORT_DIRTGL_DIRTGL_Pos)) /* Assigment of value for DIRTGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_Msk _UINT32_(0xFFFFFFFF) /* (PORT_DIRTGL) Register Mask  */


/* -------- PORT_OUT : (PORT Offset: 0x10) (R/W 32) Data Output Value -------- */
#define PORT_OUT_RESETVALUE _UINT32_(0x00) /*  (PORT_OUT) Data Output Value  Reset Value */

#define PORT_OUT_OUT_Pos _UINT32_(0) /* (PORT_OUT) Port Data Output Value Position */
#define PORT_OUT_OUT_Msk (_UINT32_(0xFFFFFFFF) << PORT_OUT_OUT_Pos) /* (PORT_OUT) Port Data Output Value Mask */
#define PORT_OUT_OUT(value)                                                                                            \
        (PORT_OUT_OUT_Msk &                                                                                            \
         (_UINT32_(value) << PORT_OUT_OUT_Pos)) /* Assigment of value for OUT in the PORT_OUT register */
#define PORT_OUT_Msk _UINT32_(0xFFFFFFFF) /* (PORT_OUT) Register Mask  */


/* -------- PORT_OUTCLR : (PORT Offset: 0x14) (R/W 32) Data Output Value Clear -------- */
#define PORT_OUTCLR_RESETVALUE _UINT32_(0x00) /*  (PORT_OUTCLR) Data Output Value Clear  Reset Value */

#define PORT_OUTCLR_OUTCLR_Pos _UINT32_(0) /* (PORT_OUTCLR) Port Data Output Value Clear Position */
#define PORT_OUTCLR_OUTCLR_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_OUTCLR_OUTCLR_Pos) /* (PORT_OUTCLR) Port Data Output Value Clear Mask */
#define PORT_OUTCLR_OUTCLR(value)                                                                                      \
        (PORT_OUTCLR_OUTCLR_Msk &                                                                                      \
         (_UINT32_(value) << PORT_OUTCLR_OUTCLR_Pos)) /* Assigment of value for OUTCLR in the PORT_OUTCLR register */
#define PORT_OUTCLR_Msk _UINT32_(0xFFFFFFFF) /* (PORT_OUTCLR) Register Mask  */


/* -------- PORT_OUTSET : (PORT Offset: 0x18) (R/W 32) Data Output Value Set -------- */
#define PORT_OUTSET_RESETVALUE _UINT32_(0x00) /*  (PORT_OUTSET) Data Output Value Set  Reset Value */

#define PORT_OUTSET_OUTSET_Pos _UINT32_(0) /* (PORT_OUTSET) Port Data Output Value Set Position */
#define PORT_OUTSET_OUTSET_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_OUTSET_OUTSET_Pos) /* (PORT_OUTSET) Port Data Output Value Set Mask */
#define PORT_OUTSET_OUTSET(value)                                                                                      \
        (PORT_OUTSET_OUTSET_Msk &                                                                                      \
         (_UINT32_(value) << PORT_OUTSET_OUTSET_Pos)) /* Assigment of value for OUTSET in the PORT_OUTSET register */
#define PORT_OUTSET_Msk _UINT32_(0xFFFFFFFF) /* (PORT_OUTSET) Register Mask  */


/* -------- PORT_OUTTGL : (PORT Offset: 0x1C) (R/W 32) Data Output Value Toggle -------- */
#define PORT_OUTTGL_RESETVALUE _UINT32_(0x00) /*  (PORT_OUTTGL) Data Output Value Toggle  Reset Value */

#define PORT_OUTTGL_OUTTGL_Pos _UINT32_(0) /* (PORT_OUTTGL) Port Data Output Value Toggle Position */
#define PORT_OUTTGL_OUTTGL_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_OUTTGL_OUTTGL_Pos) /* (PORT_OUTTGL) Port Data Output Value Toggle Mask */
#define PORT_OUTTGL_OUTTGL(value)                                                                                      \
        (PORT_OUTTGL_OUTTGL_Msk &                                                                                      \
         (_UINT32_(value) << PORT_OUTTGL_OUTTGL_Pos)) /* Assigment of value for OUTTGL in the PORT_OUTTGL register */
#define PORT_OUTTGL_Msk _UINT32_(0xFFFFFFFF) /* (PORT_OUTTGL) Register Mask  */


/* -------- PORT_IN : (PORT Offset: 0x20) ( R/ 32) Data Input Value -------- */
#define PORT_IN_RESETVALUE _UINT32_(0x00) /*  (PORT_IN) Data Input Value  Reset Value */

#define PORT_IN_IN_Pos _UINT32_(0) /* (PORT_IN) Port Data Input Value Position */
#define PORT_IN_IN_Msk (_UINT32_(0xFFFFFFFF) << PORT_IN_IN_Pos) /* (PORT_IN) Port Data Input Value Mask */
#define PORT_IN_IN(value)                                                                                              \
        (PORT_IN_IN_Msk & (_UINT32_(value) << PORT_IN_IN_Pos)) /* Assigment of value for IN in the PORT_IN register */
#define PORT_IN_Msk _UINT32_(0xFFFFFFFF) /* (PORT_IN) Register Mask  */


/* -------- PORT_CTRL : (PORT Offset: 0x24) (R/W 32) Control -------- */
#define PORT_CTRL_RESETVALUE _UINT32_(0x00) /*  (PORT_CTRL) Control  Reset Value */

#define PORT_CTRL_SAMPLING_Pos _UINT32_(0) /* (PORT_CTRL) Input Sampling Mode Position */
#define PORT_CTRL_SAMPLING_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << PORT_CTRL_SAMPLING_Pos) /* (PORT_CTRL) Input Sampling Mode Mask */
#define PORT_CTRL_SAMPLING(value)                                                                                      \
        (PORT_CTRL_SAMPLING_Msk &                                                                                      \
         (_UINT32_(value) << PORT_CTRL_SAMPLING_Pos)) /* Assigment of value for SAMPLING in the PORT_CTRL register */
#define PORT_CTRL_Msk _UINT32_(0xFFFFFFFF) /* (PORT_CTRL) Register Mask  */


