ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/port.h
/* -------- PORT_WRCONFIG : (PORT Offset: 0x28) ( /W 32) Write Configuration -------- */
#define PORT_WRCONFIG_RESETVALUE _UINT32_(0x00) /*  (PORT_WRCONFIG) Write Configuration  Reset Value */

#define PORT_WRCONFIG_PINMASK_Pos _UINT32_(0) /* (PORT_WRCONFIG) Pin Mask for Multiple Pin Configuration Position */
#define PORT_WRCONFIG_PINMASK_Msk                                                                                      \
        (_UINT32_(0xFFFF)                                                                                              \
         << PORT_WRCONFIG_PINMASK_Pos) /* (PORT_WRCONFIG) Pin Mask for Multiple Pin Configuration Mask */
#define PORT_WRCONFIG_PINMASK(value)                                                                                   \
        (PORT_WRCONFIG_PINMASK_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_PINMASK_Pos)) /* Assigment of value for PINMASK in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PMUXEN_Pos _UINT32_(16) /* (PORT_WRCONFIG) Peripheral Multiplexer Enable Position */
#define PORT_WRCONFIG_PMUXEN_Msk                                                                                       \
        (_UINT32_(0x1) << PORT_WRCONFIG_PMUXEN_Pos) /* (PORT_WRCONFIG) Peripheral Multiplexer Enable Mask */
#define PORT_WRCONFIG_PMUXEN(value)                                                                                    \
        (PORT_WRCONFIG_PMUXEN_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_PMUXEN_Pos)) /* Assigment of value for PMUXEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_INEN_Pos _UINT32_(17) /* (PORT_WRCONFIG) Input Enable Position */
#define PORT_WRCONFIG_INEN_Msk (_UINT32_(0x1) << PORT_WRCONFIG_INEN_Pos) /* (PORT_WRCONFIG) Input Enable Mask */
#define PORT_WRCONFIG_INEN(value)                                                                                      \
        (PORT_WRCONFIG_INEN_Msk &                                                                                      \
         (_UINT32_(value) << PORT_WRCONFIG_INEN_Pos)) /* Assigment of value for INEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PULLEN_Pos _UINT32_(18) /* (PORT_WRCONFIG) Pull Enable Position */
#define PORT_WRCONFIG_PULLEN_Msk (_UINT32_(0x1) << PORT_WRCONFIG_PULLEN_Pos) /* (PORT_WRCONFIG) Pull Enable Mask */
#define PORT_WRCONFIG_PULLEN(value)                                                                                    \
        (PORT_WRCONFIG_PULLEN_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_PULLEN_Pos)) /* Assigment of value for PULLEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_DRVSTR_Pos _UINT32_(22) /* (PORT_WRCONFIG) Output Driver Strength Selection Position */
#define PORT_WRCONFIG_DRVSTR_Msk                                                                                       \
        (_UINT32_(0x1) << PORT_WRCONFIG_DRVSTR_Pos) /* (PORT_WRCONFIG) Output Driver Strength Selection Mask */
#define PORT_WRCONFIG_DRVSTR(value)                                                                                    \
        (PORT_WRCONFIG_DRVSTR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_DRVSTR_Pos)) /* Assigment of value for DRVSTR in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PMUX_Pos _UINT32_(24) /* (PORT_WRCONFIG) Peripheral Multiplexing Position */
#define PORT_WRCONFIG_PMUX_Msk                                                                                         \
        (_UINT32_(0xF) << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral Multiplexing Mask */
#define PORT_WRCONFIG_PMUX(value)                                                                                      \
        (PORT_WRCONFIG_PMUX_Msk &                                                                                      \
         (_UINT32_(value) << PORT_WRCONFIG_PMUX_Pos)) /* Assigment of value for PMUX in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_WRPMUX_Pos _UINT32_(28) /* (PORT_WRCONFIG) Write PMUX Position */
#define PORT_WRCONFIG_WRPMUX_Msk (_UINT32_(0x1) << PORT_WRCONFIG_WRPMUX_Pos) /* (PORT_WRCONFIG) Write PMUX Mask */
#define PORT_WRCONFIG_WRPMUX(value)                                                                                    \
        (PORT_WRCONFIG_WRPMUX_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_WRPMUX_Pos)) /* Assigment of value for WRPMUX in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_WRPINCFG_Pos _UINT32_(30) /* (PORT_WRCONFIG) Write PINCFG Position */
#define PORT_WRCONFIG_WRPINCFG_Msk (_UINT32_(0x1) << PORT_WRCONFIG_WRPINCFG_Pos) /* (PORT_WRCONFIG) Write PINCFG Mask  \
                                                                                  */
#define PORT_WRCONFIG_WRPINCFG(value)                                                                                  \
        (PORT_WRCONFIG_WRPINCFG_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_WRPINCFG_Pos)) /* Assigment of value for WRPINCFG in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_HWSEL_Pos _UINT32_(31) /* (PORT_WRCONFIG) Half-Word Select Position */
#define PORT_WRCONFIG_HWSEL_Msk (_UINT32_(0x1) << PORT_WRCONFIG_HWSEL_Pos) /* (PORT_WRCONFIG) Half-Word Select Mask */
#define PORT_WRCONFIG_HWSEL(value)                                                                                     \
        (PORT_WRCONFIG_HWSEL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << PORT_WRCONFIG_HWSEL_Pos)) /* Assigment of value for HWSEL in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_Msk _UINT32_(0xDF47FFFF) /* (PORT_WRCONFIG) Register Mask  */


/* -------- PORT_PMUX : (PORT Offset: 0x30) (R/W 8) Peripheral Multiplexing n -------- */
#define PORT_PMUX_RESETVALUE _UINT8_(0x00) /*  (PORT_PMUX) Peripheral Multiplexing n  Reset Value */

#define PORT_PMUX_PMUXE_Pos _UINT8_(0) /* (PORT_PMUX) Peripheral Multiplexing Even Position */
#define PORT_PMUX_PMUXE_Msk (_UINT8_(0xF) << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral Multiplexing Even Mask */
#define PORT_PMUX_PMUXE(value)                                                                                         \
        (PORT_PMUX_PMUXE_Msk &                                                                                         \
         (_UINT8_(value) << PORT_PMUX_PMUXE_Pos)) /* Assigment of value for PMUXE in the PORT_PMUX register */
#define PORT_PMUX_PMUXE_A_Val _UINT8_(0x0) /* (PORT_PMUX) Peripheral function A selected  */
#define PORT_PMUX_PMUXE_B_Val _UINT8_(0x1) /* (PORT_PMUX) Peripheral function B selected  */
#define PORT_PMUX_PMUXE_C_Val _UINT8_(0x2) /* (PORT_PMUX) Peripheral function C selected  */
#define PORT_PMUX_PMUXE_D_Val _UINT8_(0x3) /* (PORT_PMUX) Peripheral function D selected  */
#define PORT_PMUX_PMUXE_E_Val _UINT8_(0x4) /* (PORT_PMUX) Peripheral function E selected  */
#define PORT_PMUX_PMUXE_F_Val _UINT8_(0x5) /* (PORT_PMUX) Peripheral function F selected  */
#define PORT_PMUX_PMUXE_G_Val _UINT8_(0x6) /* (PORT_PMUX) Peripheral function G selected  */
#define PORT_PMUX_PMUXE_H_Val _UINT8_(0x7) /* (PORT_PMUX) Peripheral function H selected  */
#define PORT_PMUX_PMUXE_A                                                                                              \
        (PORT_PMUX_PMUXE_A_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function A selected Position  */
#define PORT_PMUX_PMUXE_B                                                                                              \
        (PORT_PMUX_PMUXE_B_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function B selected Position  */
#define PORT_PMUX_PMUXE_C                                                                                              \
        (PORT_PMUX_PMUXE_C_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function C selected Position  */
#define PORT_PMUX_PMUXE_D                                                                                              \
        (PORT_PMUX_PMUXE_D_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function D selected Position  */
#define PORT_PMUX_PMUXE_E                                                                                              \
        (PORT_PMUX_PMUXE_E_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function E selected Position  */
#define PORT_PMUX_PMUXE_F                                                                                              \
        (PORT_PMUX_PMUXE_F_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function F selected Position  */
#define PORT_PMUX_PMUXE_G                                                                                              \
        (PORT_PMUX_PMUXE_G_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function G selected Position  */
#define PORT_PMUX_PMUXE_H                                                                                              \
        (PORT_PMUX_PMUXE_H_Val << PORT_PMUX_PMUXE_Pos) /* (PORT_PMUX) Peripheral function H selected Position  */
#define PORT_PMUX_PMUXO_Pos _UINT8_(4) /* (PORT_PMUX) Peripheral Multiplexing Odd Position */
#define PORT_PMUX_PMUXO_Msk (_UINT8_(0xF) << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral Multiplexing Odd Mask */
#define PORT_PMUX_PMUXO(value)                                                                                         \
        (PORT_PMUX_PMUXO_Msk &                                                                                         \
         (_UINT8_(value) << PORT_PMUX_PMUXO_Pos)) /* Assigment of value for PMUXO in the PORT_PMUX register */
#define PORT_PMUX_PMUXO_A_Val _UINT8_(0x0) /* (PORT_PMUX) Peripheral function A selected  */
#define PORT_PMUX_PMUXO_B_Val _UINT8_(0x1) /* (PORT_PMUX) Peripheral function B selected  */
#define PORT_PMUX_PMUXO_C_Val _UINT8_(0x2) /* (PORT_PMUX) Peripheral function C selected  */
#define PORT_PMUX_PMUXO_D_Val _UINT8_(0x3) /* (PORT_PMUX) Peripheral function D selected  */
#define PORT_PMUX_PMUXO_E_Val _UINT8_(0x4) /* (PORT_PMUX) Peripheral function E selected  */
#define PORT_PMUX_PMUXO_F_Val _UINT8_(0x5) /* (PORT_PMUX) Peripheral function F selected  */
#define PORT_PMUX_PMUXO_G_Val _UINT8_(0x6) /* (PORT_PMUX) Peripheral function G selected  */
#define PORT_PMUX_PMUXO_H_Val _UINT8_(0x7) /* (PORT_PMUX) Peripheral function H selected  */
#define PORT_PMUX_PMUXO_A                                                                                              \
        (PORT_PMUX_PMUXO_A_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function A selected Position  */
#define PORT_PMUX_PMUXO_B                                                                                              \
        (PORT_PMUX_PMUXO_B_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function B selected Position  */
#define PORT_PMUX_PMUXO_C                                                                                              \
        (PORT_PMUX_PMUXO_C_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function C selected Position  */
#define PORT_PMUX_PMUXO_D                                                                                              \
        (PORT_PMUX_PMUXO_D_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function D selected Position  */
#define PORT_PMUX_PMUXO_E                                                                                              \
        (PORT_PMUX_PMUXO_E_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function E selected Position  */
#define PORT_PMUX_PMUXO_F                                                                                              \
        (PORT_PMUX_PMUXO_F_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function F selected Position  */
#define PORT_PMUX_PMUXO_G                                                                                              \
        (PORT_PMUX_PMUXO_G_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function G selected Position  */
#define PORT_PMUX_PMUXO_H                                                                                              \
        (PORT_PMUX_PMUXO_H_Val << PORT_PMUX_PMUXO_Pos) /* (PORT_PMUX) Peripheral function H selected Position  */
#define PORT_PMUX_Msk _UINT8_(0xFF) /* (PORT_PMUX) Register Mask  */


/* -------- PORT_PINCFG : (PORT Offset: 0x40) (R/W 8) Pin Configuration n -------- */
#define PORT_PINCFG_RESETVALUE _UINT8_(0x00) /*  (PORT_PINCFG) Pin Configuration n  Reset Value */

#define PORT_PINCFG_PMUXEN_Pos _UINT8_(0) /* (PORT_PINCFG) Peripheral Multiplexer Enable Position */
#define PORT_PINCFG_PMUXEN_Msk                                                                                         \
        (_UINT8_(0x1) << PORT_PINCFG_PMUXEN_Pos) /* (PORT_PINCFG) Peripheral Multiplexer Enable Mask */
#define PORT_PINCFG_PMUXEN(value)                                                                                      \
        (PORT_PINCFG_PMUXEN_Msk &                                                                                      \
         (_UINT8_(value) << PORT_PINCFG_PMUXEN_Pos)) /* Assigment of value for PMUXEN in the PORT_PINCFG register */
#define PORT_PINCFG_INEN_Pos _UINT8_(1) /* (PORT_PINCFG) Input Enable Position */
#define PORT_PINCFG_INEN_Msk (_UINT8_(0x1) << PORT_PINCFG_INEN_Pos) /* (PORT_PINCFG) Input Enable Mask */
#define PORT_PINCFG_INEN(value)                                                                                        \
        (PORT_PINCFG_INEN_Msk &                                                                                        \
         (_UINT8_(value) << PORT_PINCFG_INEN_Pos)) /* Assigment of value for INEN in the PORT_PINCFG register */
#define PORT_PINCFG_PULLEN_Pos _UINT8_(2) /* (PORT_PINCFG) Pull Enable Position */
#define PORT_PINCFG_PULLEN_Msk (_UINT8_(0x1) << PORT_PINCFG_PULLEN_Pos) /* (PORT_PINCFG) Pull Enable Mask */
#define PORT_PINCFG_PULLEN(value)                                                                                      \
        (PORT_PINCFG_PULLEN_Msk &                                                                                      \
         (_UINT8_(value) << PORT_PINCFG_PULLEN_Pos)) /* Assigment of value for PULLEN in the PORT_PINCFG register */
#define PORT_PINCFG_DRVSTR_Pos _UINT8_(6) /* (PORT_PINCFG) Output Driver Strength Selection Position */
#define PORT_PINCFG_DRVSTR_Msk                                                                                         \
        (_UINT8_(0x1) << PORT_PINCFG_DRVSTR_Pos) /* (PORT_PINCFG) Output Driver Strength Selection Mask */
#define PORT_PINCFG_DRVSTR(value)                                                                                      \
        (PORT_PINCFG_DRVSTR_Msk &                                                                                      \
         (_UINT8_(value) << PORT_PINCFG_DRVSTR_Pos)) /* Assigment of value for DRVSTR in the PORT_PINCFG register */
#define PORT_PINCFG_Msk _UINT8_(0x47) /* (PORT_PINCFG) Register Mask  */


