ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/port.h
/** \brief PORT register offsets definitions */
#define PORT_DIR_REG_OFST _UINT32_(0x00) /* (PORT_DIR) Data Direction Offset */
#define PORT_DIRCLR_REG_OFST _UINT32_(0x04) /* (PORT_DIRCLR) Data Direction Clear Offset */
#define PORT_DIRSET_REG_OFST _UINT32_(0x08) /* (PORT_DIRSET) Data Direction Set Offset */
#define PORT_DIRTGL_REG_OFST _UINT32_(0x0C) /* (PORT_DIRTGL) Data Direction Toggle Offset */
#define PORT_OUT_REG_OFST _UINT32_(0x10) /* (PORT_OUT) Data Output Value Offset */
#define PORT_OUTCLR_REG_OFST _UINT32_(0x14) /* (PORT_OUTCLR) Data Output Value Clear Offset */
#define PORT_OUTSET_REG_OFST _UINT32_(0x18) /* (PORT_OUTSET) Data Output Value Set Offset */
#define PORT_OUTTGL_REG_OFST _UINT32_(0x1C) /* (PORT_OUTTGL) Data Output Value Toggle Offset */
#define PORT_IN_REG_OFST _UINT32_(0x20) /* (PORT_IN) Data Input Value Offset */
#define PORT_CTRL_REG_OFST _UINT32_(0x24) /* (PORT_CTRL) Control Offset */
#define PORT_WRCONFIG_REG_OFST _UINT32_(0x28) /* (PORT_WRCONFIG) Write Configuration Offset */
#define PORT_PMUX_REG_OFST _UINT32_(0x30) /* (PORT_PMUX) Peripheral Multiplexing n Offset */
#define PORT_PMUX0_REG_OFST _UINT32_(0x30) /* (PORT_PMUX0) Peripheral Multiplexing n Offset */
#define PORT_PMUX1_REG_OFST _UINT32_(0x31) /* (PORT_PMUX1) Peripheral Multiplexing n Offset */
#define PORT_PMUX2_REG_OFST _UINT32_(0x32) /* (PORT_PMUX2) Peripheral Multiplexing n Offset */
#define PORT_PMUX3_REG_OFST _UINT32_(0x33) /* (PORT_PMUX3) Peripheral Multiplexing n Offset */
#define PORT_PMUX4_REG_OFST _UINT32_(0x34) /* (PORT_PMUX4) Peripheral Multiplexing n Offset */
#define PORT_PMUX5_REG_OFST _UINT32_(0x35) /* (PORT_PMUX5) Peripheral Multiplexing n Offset */
#define PORT_PMUX6_REG_OFST _UINT32_(0x36) /* (PORT_PMUX6) Peripheral Multiplexing n Offset */
#define PORT_PMUX7_REG_OFST _UINT32_(0x37) /* (PORT_PMUX7) Peripheral Multiplexing n Offset */
#define PORT_PMUX8_REG_OFST _UINT32_(0x38) /* (PORT_PMUX8) Peripheral Multiplexing n Offset */
#define PORT_PMUX9_REG_OFST _UINT32_(0x39) /* (PORT_PMUX9) Peripheral Multiplexing n Offset */
#define PORT_PMUX10_REG_OFST _UINT32_(0x3A) /* (PORT_PMUX10) Peripheral Multiplexing n Offset */
#define PORT_PMUX11_REG_OFST _UINT32_(0x3B) /* (PORT_PMUX11) Peripheral Multiplexing n Offset */
#define PORT_PMUX12_REG_OFST _UINT32_(0x3C) /* (PORT_PMUX12) Peripheral Multiplexing n Offset */
#define PORT_PMUX13_REG_OFST _UINT32_(0x3D) /* (PORT_PMUX13) Peripheral Multiplexing n Offset */
#define PORT_PMUX14_REG_OFST _UINT32_(0x3E) /* (PORT_PMUX14) Peripheral Multiplexing n Offset */
#define PORT_PMUX15_REG_OFST _UINT32_(0x3F) /* (PORT_PMUX15) Peripheral Multiplexing n Offset */
#define PORT_PINCFG_REG_OFST _UINT32_(0x40) /* (PORT_PINCFG) Pin Configuration n Offset */
#define PORT_PINCFG0_REG_OFST _UINT32_(0x40) /* (PORT_PINCFG0) Pin Configuration n Offset */
#define PORT_PINCFG1_REG_OFST _UINT32_(0x41) /* (PORT_PINCFG1) Pin Configuration n Offset */
#define PORT_PINCFG2_REG_OFST _UINT32_(0x42) /* (PORT_PINCFG2) Pin Configuration n Offset */
#define PORT_PINCFG3_REG_OFST _UINT32_(0x43) /* (PORT_PINCFG3) Pin Configuration n Offset */
#define PORT_PINCFG4_REG_OFST _UINT32_(0x44) /* (PORT_PINCFG4) Pin Configuration n Offset */
#define PORT_PINCFG5_REG_OFST _UINT32_(0x45) /* (PORT_PINCFG5) Pin Configuration n Offset */
#define PORT_PINCFG6_REG_OFST _UINT32_(0x46) /* (PORT_PINCFG6) Pin Configuration n Offset */
#define PORT_PINCFG7_REG_OFST _UINT32_(0x47) /* (PORT_PINCFG7) Pin Configuration n Offset */
#define PORT_PINCFG8_REG_OFST _UINT32_(0x48) /* (PORT_PINCFG8) Pin Configuration n Offset */
#define PORT_PINCFG9_REG_OFST _UINT32_(0x49) /* (PORT_PINCFG9) Pin Configuration n Offset */
#define PORT_PINCFG10_REG_OFST _UINT32_(0x4A) /* (PORT_PINCFG10) Pin Configuration n Offset */
#define PORT_PINCFG11_REG_OFST _UINT32_(0x4B) /* (PORT_PINCFG11) Pin Configuration n Offset */
#define PORT_PINCFG12_REG_OFST _UINT32_(0x4C) /* (PORT_PINCFG12) Pin Configuration n Offset */
#define PORT_PINCFG13_REG_OFST _UINT32_(0x4D) /* (PORT_PINCFG13) Pin Configuration n Offset */
#define PORT_PINCFG14_REG_OFST _UINT32_(0x4E) /* (PORT_PINCFG14) Pin Configuration n Offset */
#define PORT_PINCFG15_REG_OFST _UINT32_(0x4F) /* (PORT_PINCFG15) Pin Configuration n Offset */
#define PORT_PINCFG16_REG_OFST _UINT32_(0x50) /* (PORT_PINCFG16) Pin Configuration n Offset */
#define PORT_PINCFG17_REG_OFST _UINT32_(0x51) /* (PORT_PINCFG17) Pin Configuration n Offset */
#define PORT_PINCFG18_REG_OFST _UINT32_(0x52) /* (PORT_PINCFG18) Pin Configuration n Offset */
#define PORT_PINCFG19_REG_OFST _UINT32_(0x53) /* (PORT_PINCFG19) Pin Configuration n Offset */
#define PORT_PINCFG20_REG_OFST _UINT32_(0x54) /* (PORT_PINCFG20) Pin Configuration n Offset */
#define PORT_PINCFG21_REG_OFST _UINT32_(0x55) /* (PORT_PINCFG21) Pin Configuration n Offset */
#define PORT_PINCFG22_REG_OFST _UINT32_(0x56) /* (PORT_PINCFG22) Pin Configuration n Offset */
#define PORT_PINCFG23_REG_OFST _UINT32_(0x57) /* (PORT_PINCFG23) Pin Configuration n Offset */
#define PORT_PINCFG24_REG_OFST _UINT32_(0x58) /* (PORT_PINCFG24) Pin Configuration n Offset */
#define PORT_PINCFG25_REG_OFST _UINT32_(0x59) /* (PORT_PINCFG25) Pin Configuration n Offset */
#define PORT_PINCFG26_REG_OFST _UINT32_(0x5A) /* (PORT_PINCFG26) Pin Configuration n Offset */
#define PORT_PINCFG27_REG_OFST _UINT32_(0x5B) /* (PORT_PINCFG27) Pin Configuration n Offset */
#define PORT_PINCFG28_REG_OFST _UINT32_(0x5C) /* (PORT_PINCFG28) Pin Configuration n Offset */
#define PORT_PINCFG29_REG_OFST _UINT32_(0x5D) /* (PORT_PINCFG29) Pin Configuration n Offset */
#define PORT_PINCFG30_REG_OFST _UINT32_(0x5E) /* (PORT_PINCFG30) Pin Configuration n Offset */
#define PORT_PINCFG31_REG_OFST _UINT32_(0x5F) /* (PORT_PINCFG31) Pin Configuration n Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GROUP register API structure */
typedef struct {
        __IO uint32_t PORT_DIR; /**< Offset: 0x00 (R/W  32) Data Direction */
        __IO uint32_t PORT_DIRCLR; /**< Offset: 0x04 (R/W  32) Data Direction Clear */
        __IO uint32_t PORT_DIRSET; /**< Offset: 0x08 (R/W  32) Data Direction Set */
        __IO uint32_t PORT_DIRTGL; /**< Offset: 0x0C (R/W  32) Data Direction Toggle */
        __IO uint32_t PORT_OUT; /**< Offset: 0x10 (R/W  32) Data Output Value */
        __IO uint32_t PORT_OUTCLR; /**< Offset: 0x14 (R/W  32) Data Output Value Clear */
        __IO uint32_t PORT_OUTSET; /**< Offset: 0x18 (R/W  32) Data Output Value Set */
        __IO uint32_t PORT_OUTTGL; /**< Offset: 0x1C (R/W  32) Data Output Value Toggle */
        __I uint32_t PORT_IN; /**< Offset: 0x20 (R/   32) Data Input Value */
        __IO uint32_t PORT_CTRL; /**< Offset: 0x24 (R/W  32) Control */
        __O uint32_t PORT_WRCONFIG; /**< Offset: 0x28 ( /W  32) Write Configuration */
        __I uint8_t Reserved1[0x04];
        __IO uint8_t PORT_PMUX[16]; /**< Offset: 0x30 (R/W  8) Peripheral Multiplexing n */
        __IO uint8_t PORT_PINCFG[32]; /**< Offset: 0x40 (R/W  8) Pin Configuration n */
        __I uint8_t Reserved2[0x20];
} port_group_registers_t;

#define PORT_GROUP_NUMBER 2

/** \brief PORT register API structure */
typedef struct { /* Port Module */
        port_group_registers_t GROUP[PORT_GROUP_NUMBER]; /**< Offset: 0x00  */
} port_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_PORT_COMPONENT_H_ */
